import QtQuick 2.11

Item {
    property var home: [
        {
            words: ["Россия —", "священная", "наша", "держава,"],
            position: 0
        },
        {
            words: ["Россия —", "любимая", "наша", "страна,"],
            position: 10000
        },
        {
            words: ["Могучая", "воля,", "великая", "слава —"],
            position: 16000
        },
        {
            words: ["Твоё", "достоянье", "на", "все", "времена!"],
            position: 23000
        },
        {
            words: ["Славься,", "Отечество", "наше", "свободное,"],
            position: 30000
        },
        {
            words: ["Братских,", "народов", "союз", "вековой,"],
            position: 43000
        },
        {
            words: ["Предками", "данная", "мудрость", "народная!"],
            position: 49000
        },
        {
            words: ["Славься,", "страна!", "Мы", "гордимся", "тобой!"],
            position: 63000
        },
        {
            words: ["От", "южных", "морей", "до", "полярного", "края"],
            position: 69000
        },
        {
            words: ["Раскинулись", "наши", "леса", "и", "поля."],
            position: 76000
        },
        {
            words: ["Одна", "ты", "на", "свете!", "Одна", "ты", "такая —"],
            position: 82000
        },
        {
            words: ["Хранимая", "Богом", "родная", "земля!"],
            position: 89000
        },
        {
            words: ["Славься,", "Отечество", "наше", "свободное,"],
            position: 97000
        },
        {
            words: ["Братских,", "народов", "союз", "вековой,"],
            position: 110000
        },
        {
            words: ["Предками", "данная", "мудрость", "народная!"],
            position: 117000
        },
        {
            words: ["Славься,", "страна!", "Мы", "гордимся", "тобой!"],
            position: 130000
        },
        {
            words: ["Широкий", "простор", "для", "мечты", "и", "для", "жизни"],
            position: 137000
        },
        {
            words: ["Грядущие", "нам", "открывают", "года."],
            position: 144000
        },
        {
            words: ["Нам", "силу", "даёт", "наша", "верность", "Отчизне."],
            position: 150000
        },
        {
            words: [
                "Так", "было,", "так", "есть", "и", "так", "будет", "всегда!"
            ],
            position:157000
        },
        {
            words: ["Славься,", "Отечество", "наше", "свободное,"],
            position: 165000
        },
        {
            words: ["Братских,", "народов", "союз", "вековой,"],
            position: 178000
        },
        {
            words: ["Предками", "данная", "мудрость", "народная!"],
            position: 185000
        },
        {
            words: ["Славься,", "страна!", "Мы", "гордимся", "тобой!"],
            position: 199000
        }
    ]

    property var help: [
        { words: ["Проведите", "пальцем", "чтобы,", "увидеть", "больше."] },
        { words: ["Нажмите", "на", "слова,", "чтобы", "услышать", "их."] },
        { words: ["Нажимайте", "стрелки", "для", "перемещения."] },
        { words: ["Нажмите", "клавишу", "F1,", "чтобы", "открыть", "справку."] },
        { words: ["Нажмите", "клавишу", "F2,", "чтобы", "включить", "голоса."] },
        { words: ["Голоса", "на", "сайте", "ttsmp3."] },
        { words: ["Рубенс", "Шмитц,", "разработчик.", "Qt,", "библиотека."] },
        { words: ["Для", "Astra", "Linux", "от", "РусБИТех."] },
    ]
}
